Revit 2024 API
WallType.Width Property
 The overall thickness of this type of wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Width { get; }
Visual Basic
Public ReadOnly Property Width As Double
	Get
Visual C++
public:
property double Width {
	double get ();
}
See Also
WallType Class
Autodesk.Revit.DB Namespace